registros/app/controllers/pages_controller.rb

  def crear
    Tag.create(
    nombre:            params[:nombre],
    apellido:          params[:apellido],
    correo:            params[:correo],
    password:          params[:password],
    color_favorito:    params[:color_favorito]
    )
---
INSERT INTO "tags" ("nombre", "apellido", "correo", "password", "color_favorito", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)